# 100 pandas puzzles

Inspired by [100 Numpy exerises](https://github.com/rougier/numpy-100), here are 100* short puzzles for testing your knowledge of [pandas'](http://pandas.pydata.org/) power.

Since pandas is a large library with many different specialist features and functions, these excercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating, cleaning), making use of the core DataFrame and Series objects. 

Many of the excerises here are stright-forward in that the solutions require no more than a few lines of code (in pandas or NumPy... don't go using pure Python or Cython!). Choosing the right methods and following best practices is the underlying goal.

The exercises are loosely divided in sections. Each section has a difficulty rating; these ratings are subjective, of course, but should be a seen as a rough guide as to how inventive the required solution is.

If you're just starting out with pandas and you are looking for some other resources, the official documentation  is very extensive. In particular, some good places get a broader overview of pandas are...

- [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
- [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
- [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
- [cookbook and idioms](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Enjoy the puzzles!

\* *the list of exercises is not yet complete! Pull requests or suggestions for additional exercises, corrections and improvements are welcomed.*

## Importing pandas

### Getting started and checking your pandas setup

Difficulty: *easy* 

**1.** Import pandas under the name `pd`.

In [1]:
import numpy as np
import pandas as pd

**2.** Print the version of pandas that has been imported.

In [3]:
print('Nunmpy version :{0:s}'.format(np.__version__))
print('Pandas version :{0:s}'.format(pd.__version__))

Nunmpy version :1.13.3
Pandas version :0.20.3

**3.** Print out all the version information of the libraries that are required by the pandas library.

In [5]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.6.3.final.0
python-bits: 64
OS: Windows
OS-release: 7
machine: AMD64
processor: Intel64 Family 6 Model 62 Stepping 4, GenuineIntel
byteorder: little
LC_ALL: None
LANG: None
LOCALE: None.None

pandas: 0.20.3
pytest: 3.2.1
pip: 9.0.1
setuptools: 36.5.0.post20170921
Cython: 0.26.1
numpy: 1.13.3
scipy: 0.19.1
xarray: None
IPython: 6.1.0
sphinx: 1.6.3
patsy: 0.4.1
dateutil: 2.6.1
pytz: 2017.2
blosc: None
bottleneck: 1.2.1
tables: 3.4.2
numexpr: 2.6.2
feather: None
matplotlib: 2.1.0
openpyxl: 2.4.8
xlrd: 1.1.0
xlwt: 1.3.0
xlsxwriter: 1.0.2
lxml: 4.1.0
bs4: 4.6.0
html5lib: 0.999999999
sqlalchemy: 1.1.13
pymysql: None
psycopg2: None
jinja2: 2.9.6
s3fs: None
pandas_gbq: None
pandas_datareader: None

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Difficulty: *easy*

Note: remember to import numpy using:
```python
import numpy as np
```

Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**4.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [42]:
df = pd.DataFrame(data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}, 
                  index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  2.0    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

**5.** Display a summary of the basic information about this DataFrame and its data.

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
age         8 non-null float64
animal      10 non-null object
priority    10 non-null object
visits      10 non-null int64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**6.** Return the first 3 rows of the DataFrame `df`.

In [12]:
df.head(3)

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

**7.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [13]:
df.loc[:,['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**8.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [14]:
df.iloc[[3,4,8]].loc[:,['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**9.** Select only the rows where the number of visits is greater than 3.

In [15]:
df.loc[df.visits > 3]

Empty DataFrame
Columns: [age, animal, priority, visits]
Index: []

**10.** Select the rows where the age is missing, i.e. is `NaN`.

In [16]:
df.loc[df.age.isnull()]

   age animal priority  visits
d  NaN    dog      yes       3
h  NaN    cat      yes       1

**11.** Select the rows where the animal is a cat *and* the age is less than 3.

In [17]:
df.loc[(df.animal == 'cat') & (df.age < 3)]

   age animal priority  visits
a  2.5    cat      yes       1
f  2.0    cat       no       3

**12.** Select the rows the age is between 2 and 4 (inclusive).

In [18]:
df.loc[(df.age >= 2) & (df.age <= 4)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
f  2.0    cat       no       3
j  3.0    dog       no       1

In [ ]:
# Solution 2
df[df['age'].between(2, 4)]

**13.** Change the age in row 'f' to 1.5.

In [28]:
df.loc['f','age'] = 1.5
df.loc['f']

age         1.5
animal      cat
priority     no
visits        3
Name: f, dtype: object

**14.** Calculate the sum of all visits (the total number of visits).

In [29]:
np.sum(df.visits.values)

19

**15.** Calculate the mean age for each different animal in `df`.

In [30]:
df.groupby('animal').agg({'age':['mean',np.std]})

             age
            mean       std
animal
cat     2.333333  0.763763
dog     5.000000  2.000000
snake   2.500000  2.828427

**16.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [31]:
df2 = df.append(pd.DataFrame(data=dict(zip(df.columns, (5, 'hog', 'yes','3'))), index=['k']))
df2

   age animal priority visits
a  2.5    cat      yes      1
b  3.0    cat      yes      3
c  0.5  snake       no      2
d  NaN    dog      yes      3
e  5.0    dog       no      2
f  1.5    cat       no      3
g  4.5  snake       no      1
h  NaN    cat      yes      1
i  7.0    dog       no      2
j  3.0    dog       no      1
k  5.0    hog      yes      3

In [32]:
df = df2.drop('k')
df

   age animal priority visits
a  2.5    cat      yes      1
b  3.0    cat      yes      3
c  0.5  snake       no      2
d  NaN    dog      yes      3
e  5.0    dog       no      2
f  1.5    cat       no      3
g  4.5  snake       no      1
h  NaN    cat      yes      1
i  7.0    dog       no      2
j  3.0    dog       no      1

**17.** Count the number of each type of animal in `df`.

In [34]:
df.groupby('animal').agg(['count'])

         age priority visits
       count    count  count
animal
cat        3        4      4
dog        3        4      4
snake      2        2      2

In [35]:
# Solution 2
df.animal.value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [37]:
# Solution 3
df.age.value_counts(dropna=False)

NaN     2
 3.0    2
 7.0    1
 4.5    1
 1.5    1
 5.0    1
 0.5    1
 2.5    1
Name: age, dtype: int64

**18.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order.

In [39]:
df.sort_values(by=['age','visits'], ascending=[False, True])

   age animal priority visits
i  7.0    dog       no      2
e  5.0    dog       no      2
g  4.5  snake       no      1
j  3.0    dog       no      1
b  3.0    cat      yes      3
a  2.5    cat      yes      1
f  1.5    cat       no      3
c  0.5  snake       no      2
h  NaN    cat      yes      1
d  NaN    dog      yes      3

**19.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [43]:
df['priority'] = df['priority'].map({'yes':True, 'no':False})
df

   age animal  priority  visits
a  2.5    cat      True       1
b  3.0    cat      True       3
c  0.5  snake     False       2
d  NaN    dog      True       3
e  5.0    dog     False       2
f  2.0    cat     False       3
g  4.5  snake     False       1
h  NaN    cat      True       1
i  7.0    dog     False       2
j  3.0    dog     False       1

**20.** In the 'animal' column, change the 'snake' entries to 'python'.

In [44]:
df.loc[df.animal == 'snake',['animal']] = 'python'
df

   age  animal  priority  visits
a  2.5     cat      True       1
b  3.0     cat      True       3
c  0.5  python     False       2
d  NaN     dog      True       3
e  5.0     dog     False       2
f  2.0     cat     False       3
g  4.5  python     False       1
h  NaN     cat      True       1
i  7.0     dog     False       2
j  3.0     dog     False       1

**21.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [45]:
df.groupby(['animal','visits'])['age'].agg('mean').unstack(-1)

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
python  4.5  0.5  NaN

In [47]:
# Solution 2
df.pivot_table(index='animal', columns='visits', values='age')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
python  4.5  0.5  NaN

## DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

Difficulty: *medium*

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.

**22.** You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

In [48]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [51]:
df.loc[df.A == df.A.shift(1)]

    A
2   2
6   5
7   5
10  7

**23.** Given a DataFrame of numeric values, say
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

In [52]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.795957  0.078996  0.843085
1  0.712694  0.592338  0.842860
2  0.218117  0.463866  0.485348
3  0.664721  0.760803  0.186584
4  0.708929  0.084931  0.860243

In [55]:
df2 = df - df.apply(np.mean, axis=0)
df2

          0         1         2
0  0.175874 -0.317190  0.199461
1  0.092610  0.196152  0.199236
2 -0.401967  0.067679 -0.158276
3  0.044637  0.364616 -0.457040
4  0.088846 -0.311256  0.216619

**24.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? (Find that column's label.)

In [57]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.685743,0.907267,0.010808,0.111568,0.363777,0.384726,0.183317,0.526125,0.317476,0.693306
1,0.034369,0.040665,0.168303,0.624037,0.799074,0.256102,0.433909,0.959529,0.287184,0.149484
2,0.952863,0.303323,0.624705,0.601918,0.095550,0.581846,0.952126,0.209373,0.993290,0.896561
3,0.148919,0.229242,0.381753,0.287432,0.415883,0.079133,0.082263,0.510461,0.689546,0.154357
4,0.490577,0.138763,0.208755,0.670429,0.303806,0.107724,0.251245,0.587535,0.097350,0.650058

In [61]:
df2 = df.apply(sum, axis=0)
df2.idxmax()

'h'

<font color='red'>**25.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?</font>

The next three puzzles are slightly harder...

**26.** You have a DataFrame that consists of 10 columns of floating--point numbers. Suppose that exactly 5 entries in each row are NaN values. For each row of the DataFrame, find the *column* which contains the *third* NaN value.

(You should return a Series of column labels.)

In [121]:
x = np.random.random(size=(3, 8))
x

array([[ 0.1392695 ,  0.49156038,  0.84652988,  0.02312602,  0.16224654,
         0.28540599,  0.43775492,  0.03299285],
       [ 0.11741734,  0.37050839,  0.44580559,  0.30606172,  0.19313755,
         0.19530329,  0.9695544 ,  0.67543201],
       [ 0.58508639,  0.70670291,  0.65285295,  0.09344369,  0.49644428,
         0.77095766,  0.56282314,  0.93916467]])

In [126]:
# Set 3 entries in each row to nan
idx_nan = np.concatenate([np.random.choice(4, 3, replace=False) for i in range(3)])
x[np.repeat([0,1,2],3), idx_nan] = np.nan
x

array([[        nan,         nan,         nan,  0.02312602,  0.16224654,
         0.28540599,  0.43775492,  0.03299285],
       [        nan,         nan,  0.44580559,         nan,  0.19313755,
         0.19530329,  0.9695544 ,  0.67543201],
       [ 0.58508639,         nan,         nan,         nan,  0.49644428,
         0.77095766,  0.56282314,  0.93916467]])

In [128]:
# find the column index which contains the SECOND nan value
df = pd.DataFrame(data=x, columns = np.arange(x.shape[1]))
df

          0   1         2         3         4         5         6         7
0       NaN NaN       NaN  0.023126  0.162247  0.285406  0.437755  0.032993
1       NaN NaN  0.445806       NaN  0.193138  0.195303  0.969554  0.675432
2  0.585086 NaN       NaN       NaN  0.496444  0.770958  0.562823  0.939165

In [135]:
(df.isnull().cumsum(axis=1) == 2).idxmax(axis = 1)

0    1
1    1
2    2
dtype: int64

**27.** A DataFrame has a column of groups 'grps' and and column of numbers 'vals'. For example: 

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values.

In [136]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [164]:
def top_n(df, column, n=3, ascending=False):
    return df.sort_values(by=column, ascending=False).head(n)

In [166]:
df.groupby("grps", as_index=False).apply(top_n, column='vals').groupby('grps').sum()

      vals
grps
a      409
b      156
c      345

**28.** A DataFrame has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). For each group of 10 consecutive integers in 'A' (i.e. `(0, 10]`, `(10, 20]`, ...), calculate the sum of the corresponding values in column 'B'.

In [173]:
df = pd.DataFrame({'A':np.arange(1,101), 'B':np.random.random(100)})
grps = pd.cut(df.A, np.arange(0, 101, 10))
df.groupby(grps)['B'].sum()

A
(0, 10]      3.492699
(10, 20]     5.187030
(20, 30]     5.242389
(30, 40]     6.535718
(40, 50]     4.383950
(50, 60]     4.764031
(60, 70]     5.218032
(70, 80]     4.724850
(80, 90]     7.246212
(90, 100]    5.529372
Name: B, dtype: float64

## DataFrames: harder problems 

### These might require a bit of thinking outside the box...

...but all are solvable using just the usual pandas/NumPy methods (and so avoid using explicit `for` loops).

Difficulty: *hard*

**29.** Consider a DataFrame `df` where there is an integer column 'X':
```python
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
```
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be `[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]`. Make this a new column 'Y'.

Here's an alternative approach based on a [cookbook recipe](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#grouping):

**30.** Consider a DataFrame containing rows and columns of purely numerical data. Create a list of the row-column index locations of the 3 largest values.

In [176]:
df = pd.DataFrame(np.random.random(size=(3,2)))
df

          0         1
0  0.872228  0.135264
1  0.638104  0.612434
2  0.510146  0.461174

In [199]:
np.transpose(np.array(np.unravel_index(np.argsort(-df.values.flatten()), dims=df.shape))[:,:3])

array([[0, 0],
       [1, 0],
       [1, 1]], dtype=int64)

In [202]:
# Solution 2
df.unstack().sort_values()[-3:].index.tolist()

[(1, 1), (0, 1), (0, 0)]

**31.** Given a DataFrame with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals', replace any negative values in 'vals' with the group mean.

In [204]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,-45,14,4,-52,54,-23,235,21,-57,3,-87]})
df

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b   -45
5     c    14
6     a     4
7     a   -52
8     b    54
9     c   -23
10    c   235
11    c    21
12    b   -57
13    b     3
14    c   -87

In [210]:
df.groupby('grps').agg('mean')

      vals
grps
a     62.4
b     -8.8
c     32.0

In [208]:
def replace_neg_with_mean(df, column):
    mean = np.mean(df[column])
    df[column] = df[column].apply(lambda x: mean if x < 0 else x)
    return df

In [209]:
df.groupby('grps').apply(replace_neg_with_mean, column='vals')

   grps   vals
0     a   12.0
1     a  345.0
2     a    3.0
3     b    1.0
4     b   -8.8
5     c   14.0
6     a    4.0
7     a   62.4
8     b   54.0
9     c   32.0
10    c  235.0
11    c   21.0
12    b   -8.8
13    b    3.0
14    c   32.0

**32.** Implement a rolling mean over groups with window size 3, which ignores NaN value. For example consider the following DataFrame:

```python
>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
>>> df
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
```
The goal is to compute the Series:

```
0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
```
E.g. the first window of size three for group 'b' has values 3.0, NaN and 3.0 and occurs at row index 5. Instead of being NaN the value in the new column at this row index should be 3.0 (just the two non-NaN values are used to compute the mean (3+3)/2)

In [213]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
df.sort_values('group')

   group  value
0      a    1.0
1      a    2.0
4      a    2.0
8      a    7.0
10     a    NaN
2      b    3.0
3      b    NaN
5      b    3.0
6      b    NaN
7      b    1.0
9      b    3.0
11     b    8.0

In [215]:
# will not exclude nan
df.rolling(3, min_periods=1).mean()

   group     value
0      a  1.000000
1      a  1.500000
2      b  2.000000
3      b  2.500000
4      a  2.500000
5      b  2.500000
6      b  2.500000
7      b  2.000000
8      a  4.000000
9      b  3.666667
10     a  5.000000
11     b  5.500000

In [217]:
g1 = df.groupby(['group'])['value']              # group values  
g2 = df.fillna(0).groupby(['group'])['value']    # fillna, then group values

In [219]:
g2.rolling(3, min_periods=1).sum()

group
a      0      1.0
       1      3.0
       4      5.0
       8     11.0
       10     9.0
b      2      3.0
       3      3.0
       5      6.0
       6      3.0
       7      4.0
       9      4.0
       11    12.0
Name: value, dtype: float64

In [220]:
g1.rolling(3, min_periods=1).count()   # count the non-nan values

group
a      0     1.0
       1     2.0
       4     3.0
       8     3.0
       10    2.0
b      2     1.0
       3     1.0
       5     2.0
       6     1.0
       7     2.0
       9     2.0
       11    3.0
Name: value, dtype: float64

In [225]:
s = g2.rolling(3, min_periods=1).sum() / g1.rolling(3, min_periods=1).count()
s.reset_index(level=0).sort_index()

   group     value
0      a  1.000000
1      a  1.500000
2      b  3.000000
3      b  3.000000
4      a  1.666667
5      b  3.000000
6      b  3.000000
7      b  2.000000
8      a  3.666667
9      b  2.000000
10     a  4.500000
11     b  4.000000

## Series and DatetimeIndex

### Exercises for creating and manipulating Series with datetime data

Difficulty: *easy/medium*

pandas is fantastic for working with dates and times. These puzzles explore some of this functionality.

**33.** Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series `s`.

In [230]:
ind = pd.DatetimeIndex(freq='B', start='2015-01-01', end='2015-12-31')
s = pd.Series(data=np.random.random(len(ind)), index=ind)
s

2015-01-01    0.717414
2015-01-02    0.910554
2015-01-05    0.566281
2015-01-06    0.480295
2015-01-07    0.900676
2015-01-08    0.563709
2015-01-09    0.211983
2015-01-12    0.468676
2015-01-13    0.253062
2015-01-14    0.005904
2015-01-15    0.034463
2015-01-16    0.684624
2015-01-19    0.788622
2015-01-20    0.707485
2015-01-21    0.352790
2015-01-22    0.643144
2015-01-23    0.479666
2015-01-26    0.326498
2015-01-27    0.866453
2015-01-28    0.068685
2015-01-29    0.426912
2015-01-30    0.755722
2015-02-02    0.656546
2015-02-03    0.475901
2015-02-04    0.769582
2015-02-05    0.141650
2015-02-06    0.821453
2015-02-09    0.413523
2015-02-10    0.223237
2015-02-11    0.879877
                ...
2015-11-20    0.177720
2015-11-23    0.802325
2015-11-24    0.400949
2015-11-25    0.102023
2015-11-26    0.104355
2015-11-27    0.067898
2015-11-30    0.871348
2015-12-01    0.087059
2015-12-02    0.279106
2015-12-03    0.664672
2015-12-04    0.460655
2015-12-07    0.234139
2015-12-08    0.112419
2015-12-09    0.407580
2015-12-10    0.534732
2015-12-11    0.615067
2015-12-14    0.159984
2015-12-15    0.764815
2015-12-16    0.859003
2015-12-17    0.699108
2015-12-18    0.838021
2015-12-21    0.322284
2015-12-22    0.022141
2015-12-23    0.140466
2015-12-24    0.829936
2015-12-25    0.258518
2015-12-28    0.813439
2015-12-29    0.313151
2015-12-30    0.743146
2015-12-31    0.157144
Freq: B, Length: 261, dtype: float64

**34.** Find the sum of the values in `s` for every Wednesday.

In [233]:
np.sum(s.loc[s.index.dayofweek == 2])

24.293944065861496

**35.** For each calendar month in `s`, find the mean of values.

In [234]:
s.groupby(pd.Grouper(freq='M')).mean()

2015-01-31    0.509710
2015-02-28    0.537767
2015-03-31    0.416722
2015-04-30    0.498272
2015-05-31    0.585742
2015-06-30    0.567050
2015-07-31    0.516200
2015-08-31    0.467240
2015-09-30    0.439020
2015-10-31    0.456989
2015-11-30    0.443963
2015-12-31    0.448547
Freq: M, dtype: float64

In [235]:
# Solution 2
s.resample('M').mean()

2015-01-31    0.509710
2015-02-28    0.537767
2015-03-31    0.416722
2015-04-30    0.498272
2015-05-31    0.585742
2015-06-30    0.567050
2015-07-31    0.516200
2015-08-31    0.467240
2015-09-30    0.439020
2015-10-31    0.456989
2015-11-30    0.443963
2015-12-31    0.448547
Freq: M, dtype: float64

**36.** For each group of four consecutive calendar months in `s`, find the date on which the highest value occurred.

In [240]:
s.resample('4M').max()

2015-01-31    0.910554
2015-05-31    0.999950
2015-09-30    0.997323
2016-01-31    0.960930
Freq: 4M, dtype: float64

In [238]:
s.groupby(pd.TimeGrouper('4M')).idxmax()

2015-01-31   2015-01-02
2015-05-31   2015-05-08
2015-09-30   2015-07-10
2016-01-31   2015-10-21
Freq: 4M, dtype: datetime64[ns]

**37.** Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

In [241]:
pd.date_range('2015-01-01', '2016-12-31', freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

## Cleaning Data

### Making a DataFrame easier to work with

Difficulty: *easy/medium*

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```
(It's some flight data I made up; it's not meant to be accurate in any way.)

**38.** Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [245]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

**39.** The From\_To column would be better as two separate columns! Split each string on the underscore delimiter `_` to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [244]:
df['From'] = df.From_To.apply(lambda x: x.split('_')[0])
df['To'] = df.From_To.apply(lambda x: x.split('_')[1])
df

,Airline,FlightNumber,From_To,RecentDelays,From,To
0,KLM(!),10045.0,LoNDon_paris,"[23, 47]",LoNDon,paris
1,<Air France> (12),NaN,MAdrid_miLAN,[],MAdrid,miLAN
2,(British Airways. ),10065.0,londON_StockhOlm,"[24, 43, 87]",londON,StockhOlm
3,12. Air France,NaN,Budapest_PaRis,[13],Budapest,PaRis
4,"""Swiss Air""",10085.0,Brussels_londOn,"[67, 32]",Brussels,londOn

In [246]:
# solution 2
temp = df.From_To.str.split('_',expand=True)
temp.columns = ['From', 'To']
df = pd.concat([df, temp], axis=1)
df

,Airline,FlightNumber,From_To,RecentDelays,From,To
0,KLM(!),10045.0,LoNDon_paris,"[23, 47]",LoNDon,paris
1,<Air France> (12),NaN,MAdrid_miLAN,[],MAdrid,miLAN
2,(British Airways. ),10065.0,londON_StockhOlm,"[24, 43, 87]",londON,StockhOlm
3,12. Air France,NaN,Budapest_PaRis,[13],Budapest,PaRis
4,"""Swiss Air""",10085.0,Brussels_londOn,"[67, 32]",Brussels,londOn

**40.** Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [247]:
df.From = df.From.str.title()
df.To = df.To.str.title()
df

,Airline,FlightNumber,From_To,RecentDelays,From,To
0,KLM(!),10045.0,LoNDon_paris,"[23, 47]",London,Paris
1,<Air France> (12),NaN,MAdrid_miLAN,[],Madrid,Milan
2,(British Airways. ),10065.0,londON_StockhOlm,"[24, 43, 87]",London,Stockholm
3,12. Air France,NaN,Budapest_PaRis,[13],Budapest,Paris
4,"""Swiss Air""",10085.0,Brussels_londOn,"[67, 32]",Brussels,London

**41.** Delete the From_To column from `df` and attach the temporary DataFrame from the previous questions.

In [248]:
df = df.drop('From_To', axis=1)
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)       10045.0      [23, 47]    London      Paris
1    <Air France> (12)           NaN            []    Madrid      Milan
2  (British Airways. )       10065.0  [24, 43, 87]    London  Stockholm
3       12. Air France           NaN          [13]  Budapest      Paris
4          "Swiss Air"       10085.0      [67, 32]  Brussels     London

**42**. In the Airline column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [249]:
df['Airline'] = df['Airline'].str.extract('([a-zA-Z\s]+)', expand=False).str.strip()
df

           Airline  FlightNumber  RecentDelays      From         To
0              KLM       10045.0      [23, 47]    London      Paris
1       Air France           NaN            []    Madrid      Milan
2  British Airways       10065.0  [24, 43, 87]    London  Stockholm
3       Air France           NaN          [13]  Budapest      Paris
4        Swiss Air       10085.0      [67, 32]  Brussels     London

<font color='red'>**43**. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.<font color='red'>

Expand the Series of lists into a DataFrame named `delays`, rename the columns `delay_1`, `delay_2`, etc. and replace the unwanted RecentDelays column in `df` with `delays`.

In [254]:
# Solution
delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_{0}'.format(i) for i in np.arange(len(delays.columns))+1]
df = df.drop('RecentDelays', axis=1).join(delays)
df

,Airline,FlightNumber,From,To,delay_1,delay_2,delay_3
0,KLM,10045.0,London,Paris,23.0,47.0,NaN
1,Air France,NaN,Madrid,Milan,NaN,NaN,NaN
2,British Airways,10065.0,London,Stockholm,24.0,43.0,87.0
3,Air France,NaN,Budapest,Paris,13.0,NaN,NaN
4,Swiss Air,10085.0,Brussels,London,67.0,32.0,NaN

The DataFrame should look much better now.

## Using MultiIndexes

### Go beyond flat DataFrames with additional index levels

Difficulty: *medium*

Previous exercises have seen us analysing data from DataFrames equipped with a single index level. However, pandas also gives you the possibilty of indexing your data using *multiple* levels. This is very much like adding new dimensions to a Series or a DataFrame. For example, a Series is 1D, but by using a MultiIndex with 2 levels we gain of much the same functionality as a 2D DataFrame.

The set of puzzles below explores how you might use multiple index levels to enhance data analysis.

To warm up, we'll look make a Series with two index levels.

**44**. Given the lists `letters = ['A', 'B', 'C']` and `numbers = list(range(10))`, construct a MultiIndex object from the product of the two lists. Use it to index a Series of random numbers. Call this Series `s`.

**45.** Check the index of `s` is lexicographically sorted (this is a necessary proprty for indexing to work correctly with a MultiIndex).

**46**. Select the labels `1`, `3` and `6` from the second level of the MultiIndexed Series.

**47**. Slice the Series `s`; slice up to label 'B' for the first level and from label 5 onwards for the second level.

**48**. Sum the values in `s` for each label in the first level (you should have Series giving you a total for labels A, B and C).

**49**. Suppose that `sum()` (and other methods) did not accept a `level` keyword argument. How else could you perform the equivalent of `s.sum(level=1)`?

**50**. Exchange the levels of the MultiIndex so we have an index of the form (letters, numbers). Is this new Series properly lexsorted? If not, sort it.

## Minesweeper

### Generate the numbers for safe squares in a Minesweeper grid

Difficulty: *medium* to *hard*

If you've ever used an older version of Windows, there's a good chance you've played with [Minesweeper](https://en.wikipedia.org/wiki/Minesweeper_(video_game). If you're not familiar with the game, imagine a grid of squares: some of these squares conceal a mine. If you click on a mine, you lose instantly. If you click on a safe square, you reveal a number telling you how many mines are found in the squares that are immediately adjacent. The aim of the game is to uncover all squares in the grid that do not contain a mine.

In this section, we'll make a DataFrame that contains the necessary data for a game of Minesweeper: coordinates of the squares, whether the square contains a mine and the number of mines found on adjacent squares.

**51**. Let's suppose we're playing Minesweeper on a 5 by 4 grid, i.e.
```
X = 5
Y = 4
```
To begin, generate a DataFrame `df` with two columns, `'x'` and `'y'` containing every coordinate for this grid. That is, the DataFrame should start:
```
   x  y
0  0  0
1  0  1
2  0  2
```

**52**. For this DataFrame `df`, create a new column of zeros (safe) and ones (mine). The probability of a mine occuring at each location should be 0.4.

**53**. Now create a new column for this DataFrame called `'adjacent'`. This column should contain the number of mines found on adjacent squares in the grid. 

(E.g. for the first row, which is the entry for the coordinate `(0, 0)`, count how many mines are found on the coordinates `(0, 1)`, `(1, 0)` and `(1, 1)`.)

**54**. For rows of the DataFrame that contain a mine, set the value in the `'adjacent'` column to NaN.

**55**. Finally, convert the DataFrame to grid of the adjacent mine counts: columns are the `x` coordinate, rows are the `y` coordinate.

## Plotting

### Visualize trends and patterns in data

Difficulty: *medium*

To really get a good understanding of the data contained in your DataFrame, it is often essential to create plots: if you're lucky, trends and anomalies will jump right out at you. This functionality is baked into pandas and the puzzles below explore some of what's possible with the library.

**56.** Pandas is highly integrated with the plotting library matplotlib, and makes plotting DataFrames very user-friendly! Plotting in a notebook environment usually makes use of the following boilerplate:

```python
import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')
```

matplotlib is the plotting library which pandas' plotting functionality is built upon, and it is usually aliased to ```plt```.

```%matplotlib inline``` tells the notebook to show plots inline, instead of creating them in a separate window.  

```plt.style.use('ggplot')``` is a style theme that most people find agreeable, based upon the styling of R's ggplot package.

For starters, make a scatter plot of this random data, but use black X's instead of the default markers. 

```df = pd.DataFrame({"xs":[1,5,2,8,1], "ys":[4,2,1,9,6]})```

Consult the [documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html) if you get stuck!

**57.** Columns in your DataFrame can also be used to modify colors and sizes.  Bill has been keeping track of his performance at work over time, as well as how good he was feeling that day, and whether he had a cup of coffee in the morning.  Make a plot which incorporates all four features of this DataFrame.

(Hint:  If you're having trouble seeing the plot, try multiplying the Series which you choose to represent size by 10 or more)

*The chart doesn't have to be pretty: this isn't a course in data viz!*

```
df = pd.DataFrame({"productivity":[5,2,3,1,4,5,6,7,8,3,4,8,9],
                   "hours_in"    :[1,9,6,5,3,9,2,9,1,7,4,2,2],
                   "happiness"   :[2,1,3,2,3,1,2,3,1,2,2,1,3],
                   "caffienated" :[0,0,1,1,0,0,0,0,1,1,0,1,0]})
```

**58.**  What if we want to plot multiple things?  Pandas allows you to pass in a matplotlib *Axis* object for plots, and plots will also return an Axis object.

Make a bar plot of monthly revenue with a line plot of monthly advertising spending (numbers in millions)

```
df = pd.DataFrame({"revenue":[57,68,63,71,72,90,80,62,59,51,47,52],
                   "advertising":[2.1,1.9,2.7,3.0,3.6,3.2,2.7,2.4,1.8,1.6,1.3,1.9],
                   "month":range(12)
                  })
```

Now we're finally ready to create a candlestick chart, which is a very common tool used to analyze stock price data.  A candlestick chart shows the opening, closing, highest, and lowest price for a stock during a time window.  The color of the "candle" (the thick part of the bar) is green if the stock closed above its opening price, or red if below.

![Candlestick Example](img/candle.jpg)

This was initially designed to be a pandas plotting challenge, but it just so happens that this type of plot is just not feasible using pandas' methods.  If you are unfamiliar with matplotlib, we have provided a function that will plot the chart for you so long as you can use pandas to get the data into the correct format.

Your first step should be to get the data in the correct format using pandas' time-series grouping function.  We would like each candle to represent an hour's worth of data.  You can write your own aggregation function which returns the open/high/low/close, but pandas has a built-in which also does this.

The below cell contains helper functions.  Call ```day_stock_data()``` to generate a DataFrame containing the prices a hypothetical stock sold for, and the time the sale occurred.  Call ```plot_candlestick(df)``` on your properly aggregated and formatted stock data to print the candlestick chart.

In [1]:
import numpy as np
def float_to_time(x):
    return str(int(x)) + ":" + str(int(x%1 * 60)).zfill(2) + ":" + str(int(x*60 % 1 * 60)).zfill(2)

def day_stock_data():
    #NYSE is open from 9:30 to 4:00
    time = 9.5
    price = 100
    results = [(float_to_time(time), price)]
    while time < 16:
        elapsed = np.random.exponential(.001)
        time += elapsed
        if time > 16:
            break
        price_diff = np.random.uniform(.999, 1.001)
        price *= price_diff
        results.append((float_to_time(time), price))
    
    
    df = pd.DataFrame(results, columns = ['time','price'])
    df.time = pd.to_datetime(df.time)
    return df

#Don't read me unless you get stuck!
def plot_candlestick(agg):
    """
    agg is a DataFrame which has a DatetimeIndex and five columns: ["open","high","low","close","color"]
    """
    fig, ax = plt.subplots()
    for time in agg.index:
        ax.plot([time.hour] * 2, agg.loc[time, ["high","low"]].values, color = "black")
        ax.plot([time.hour] * 2, agg.loc[time, ["open","close"]].values, color = agg.loc[time, "color"], linewidth = 10)

    ax.set_xlim((8,16))
    ax.set_ylabel("Price")
    ax.set_xlabel("Hour")
    ax.set_title("OHLC of Stock Value During Trading Day")
    plt.show()

**59.** Generate a day's worth of random stock data, and aggregate / reformat it so that it has hourly summaries of the opening, highest, lowest, and closing prices

**60.** Now that you have your properly-formatted data, try to plot it yourself as a candlestick chart.  Use the ```plot_candlestick(df)``` function above, or matplotlib's [```plot``` documentation](https://matplotlib.org/api/_as_gen/matplotlib.axes.Axes.plot.html) if you get stuck.

*More exercises to follow soon...*